espressif/esp-gmf/elements/gmf_ai_audio/examples/aec_rec/sdkconfig.defaults.esp32s3
CONFIG_IDF_CMAKE=y
CONFIG_IDF_TARGET_ARCH_XTENSA=y
CONFIG_IDF_TARGET="esp32s3"
CONFIG_IDF_TARGET_ESP32S3=y
CONFIG_IDF_FIRMWARE_CHIP_ID=0x0009

CONFIG_COMPILER_OPTIMIZATION_PERF=y

CONFIG_SPIRAM_MODE_OCT=y

CONFIG_ESP32S3_DEFAULT_CPU_FREQ_240=y
CONFIG_ESP32S3_INSTRUCTION_CACHE_32KB=y
CONFIG_ESP32S3_DATA_CACHE_LINE_64B=y

CONFIG_GMF_AI_AUDIO_AEC_INPUT_SAMPLING_RATE_16K=y
CONFIG_GMF_AI_AUDIO_AEC_CH_ALLOCATION="RMNM"